## Language settings
##
## [UIFont] section
##    font used for UI if you need some special font setting for the language.
## [Locale] section
##   2char language codes 
##   affect to messagebox buttons
## [Menu] section 
##   function=<Menu Text>,<Menu Mnemonic char>,<Tooltip Text> 
## [Buttons] section
##   GUI buttons. <Button Text>,<Tooltop Text>
##
[UIFont]
font=
sizesmall=9
sizenormal=12
sizelarge=12
[Locale]
locale=en
[Pane]
primitive=Primitive
layerpreview=Layer Preview
effects=Effects
[Menu]
file=File,f
new=New,n
export=Export Image File...,e,Export image as (png / jpg / bmp / gif / tga)
load=Open...,o,Open .knob file
recent=Recent files
save=Save,s
saveas=SaveAs...,a,Save as .knob file
config=Config...
exit=Exit
edit=Edit,e
undo=Undo,u
redo=Redo,r
setlayout=Set Layout...,l
layer=Layer,l
renamelayer=Rename Layer...
addlayer=Add Layer
duplayer=Dup Layer
dellayer=Del Layer
backlayer=Move Up (back),u
forelayer=Move Down (fore),d
copylayer=Copy Layer
pastelayer=Paste Layer
animcurve=AnimCurve,a
curve1=Curve1,1
curve2=Curve2,2
curve3=Curve3,3
curve4=Curve4,4
curve5=Curve5,5
curve6=Curve6,6
curve7=Curve7,7
curve8=Curve8,8
test=Test,t
testknob=Test Knob,t
help=Help,h
helpindex=Help Index,i
knobgallery=KnobGallery,g
[Layers]
preference=Preference
layer=Layer%d
[Buttons]
addlayer=Add,Add Layer
duplayer=Dup,Duplicate Layer
dellayer=Del,Delete Layer
backlayer=Back,Move Layer to Background
forelayer=Fore,Move Layer to Foreground
preview=Preview,Preview Mode
render=Render,Rendering Mode
test=Test,Test Mode
zoomout=Out,Zoom Out
zoom1=1:1,Zoom 1:1
zoomin=In,Zoom In
[Primitive]
type=Type :
typenone=None
typeimage=Image
typecircle=Circle
typecirclefill=CircleFill
typemetalcircle=MetalCircle
typewavecircle=WaveCircel
typesphere=Sphere
typerect=Rect
typerectfill=RectFill
typetriangle=Triangle
typeline=Line
typeradiateline=RadiateLines
typehlines=HLines
typevlines=VLines
typetext=Text
typeshape=Shape
aspect=Aspect :
round=Round :
width=Width :
length=Length :
step=Step :
anglestep=Angle step :
emboss=Emboss :
embossdiffuse=Emboss diffuse :
ambient=Ambient :
lightdir=Light dir :
specular=Specular :
specularwidth=Specular width:
texturefile=Texture :
texturedepth=Texture depth :
texturezoom=Texture zoom:
diffuse=Diffuse :
file=File :
fileset=Set
transparent=Transparent :
filealpha=File's alpha
opaque=Opaque
1stpixel=1st pixel
intellialpha=IntelliAlpha :
autofit=AutoFit :
multiframe=Multiframed :
framealign=Frame align :
vertical=Vertical
horizontal=Horizontal
individual=Individual
text=Text :
font=Font :
fontsize=Font size:
bold=Bold
italic=Italic
textalign=Text align:
center=Center
left=Left
right=Right
shape=Shape :
edit=Edit
fill=Fill
color=Colors :
[Effects]
antialias=Antialias
unfold=Unfold
animstep=Anim Step:
zoom=Zoom
xysepa=XY Separate
x=X :
y=Y :
layoutoffset=Offset
rotateat=Rotate At
keepdir=Keep Dir
centerx=Center X :
centery=Center Y :
angle=Angle :
colors=Colors
alpha=Alpha :
bright=Brightness :
contrast=Contrast :
saturation=Saturation :
hue=Hue :
mask=Mask
mask1ena=Mask1 Enable
mask2ena=Mask2 Enable
framemaskena=Frame mask :
none=None
range=Range
maskbits=Mask bits
framemaskbits=Frame mask bits :
op=Operation:
and=And
or=Or
masktype=Type :
rotate=Rotate
radius=Radius
horizontal=Horizontal
vertical=Vertical
gradation=Gradation :
singledir=Single Dir
bidir=Bi Dir
maskstart=Start :
maskstop=Stop :
specular=Specular
dropshadow=Drop shadow
insideshadow=Inside shadow
edgehilight=Edge hilight
lightdir=Dir :
offset=Offset :
density=Density :
diffuse=Diffuse:
shadowtype=Type :
shadowgrad=Grad :
[Prefs]
width=Width:
link=Link
height=Height:
oversampling=Over Sampling:
x1=x1
x2=x2
x4=x4
prevframes=Frames (Preview):
renderframes=Frames (Rendering):
framealign=Frame Align:
vertical=Vertical
horizontal=Horizontal
backcolor=Background Color:
exportopt=Export Option:
stitched=Stitched
individual=Individual
anim=Animation (gif/png)
duration=Duration(mSec):
loop=Loop(0 for infinite):
shuttle=Shuttle
[CurveEditor]
curvelabel=Curve-%d
stepreso=Step Reso :
close=Close
[ShapeEditor]
grid=Grid :
gridenable=Enable Grid
gridvisible=Visible Grid
fill=Fill
newpath=New Path
delpoint=Delete Point
pickhandle=Pick Handle
loadsvg=Load SVG...
savesvg=Save As SVG...
close=Close
[Config]
lookandfeel=Look & Feel :
language=Language :
shortcuts=Shortcuts :
wheeldir=Invert Mouse Wheel direction
usecapture=Use Capture in 'Test' Mode (for JRE6)
disablemnemo=Disable Key-Mnemonic
regbrowser=Register KnobBrowser
unregbrowser=Unregister KnobBrowser
ok=OK
restart=Restart
[Message]
renamelayer=Rename Layer
notsaved=File Not Saved. OK?
dellayer=Delete Layer. OK?
imgformaterr=File Format Error. Should be (png / bmp / jpg / jpeg / gif)
animformaterr=Animation File Format Error. Should be (png / gif)
notfound=File Not Found.
overwrite=File Already Exist. Overwrite?
